<?php

// сколько итераций?


$n = 100;
$array[]= [];

for ($i = 0; $i < $n; $i++) {
    for ($j = 1; $j < $n; $j *= 2) {
        $array[$i][$j]= true;
    } }

// 100 * 7 = 700 итераций

// $i дойдет до 100 итераций

// $j дойдет до 7 итераций

// 1*2 = 2
//    2*2 = 4
//        4 * 2 = 8
//            8 * 2 = 16
//                16 * 2 = 32
//                    32 * 2 = 64
//                       64 * 2 = 128


$n = 100;
$array[] = [];
for ($i = 0; $i < $n; $i += 2) {
    for ($j = $i; $j < $n; $j++) {
        $array[$i][$j]= true;
    } }


// $i будет 50 итераций 50 * 2 = 100

// $j будет 51 итерация $i + 1

// всего 51 * 50 = 2550 итераций
